---
kind: method
id: M:Autodesk.Revit.DB.FabricationConfiguration.DamperExists(System.Int32)
source: html/3b6086d3-65f7-8b3f-51c8-d261ad0be933.htm
---
# Autodesk.Revit.DB.FabricationConfiguration.DamperExists Method

Checks to see if the specified damper exists.

## Syntax (C#)
```csharp
public bool DamperExists(
	int damperId
)
```

## Parameters
- **damperId** (`System.Int32`) - The damper identifier to check.

## Returns
Returns true if the damper exists.